# =============================================================================
# Brewfile — managed by chezmoi
# Run: brew bundle --file=~/.local/share/chezmoi/Brewfile
# =============================================================================

# --- Taps ---
tap "homebrew/services"
tap "mongodb/brew"
tap "oven-sh/bun"

# --- Core CLI Tools ---
brew "bat"
brew "chezmoi"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git-delta"
brew "neovim"
brew "ripgrep"
brew "starship"
brew "tmux"
brew "tree"
brew "zoxide"

# --- Languages & Runtimes ---
brew "go"
brew "llvm"
brew "node"
brew "pnpm"
brew "yarn"
brew "oven-sh/bun/bun"

# --- Infrastructure & Services ---
brew "docker"
brew "nats-server"
brew "nginx"
brew "tailscale"
brew "mongodb/brew/mongodb-community@6.0"

# --- Build Tools ---
brew "ffmpeg"
brew "pkgconf"

# --- Casks ---
cask "anaconda"
cask "bruno"
cask "font-jetbrains-mono-nerd-font"
cask "mactex"
